learnEmbedded/STM32F1_Driver_Direct_Register/Lib/spi.h
#ifndef STM32F1_SPI_H_
#define STM32F1_SPI_H_

#include "stm32f1.h"

typedef struct {
	uint8_t SPI_DeviceMode;
	uint8_t SPI_BusConfig;
	uint8_t SPI_SclkSpeed;
	uint8_t SPI_DFF;
	uint8_t SPI_CPOL;
	uint8_t SPI_CPHA;
	uint8_t SPI_SSM;
}SPI_Config_t;

typedef struct {
	SPI_RegDef_t 	*pSPIx;
	SPI_Config_t 	SPIConfig;
	uint8_t 			*pTxBuffer;
	uint8_t				*pRxBuffer;
	uint32_t			TxLength;
	uint32_t			RxLength;
	uint8_t				TxState;
	uint8_t				RxState;
}SPI_Handle_t;

#define SPI_DEVICE_MODE_MASTER	1
#define SPI_DEVICE_MODE_SLAVE		0

#define SPI_BUS_CONFIG_FD								1
#define SPI_BUS_CONFIG_HD								2
#define SPI_BUS_CONFIG_SIMPLEX_RXONLY 	3

#define SPI_SCLK_SPEED_DIV2							0
#define SPI_SCLK_SPEED_DIV4							1
#define SPI_SCLK_SPEED_DIV8							2
#define SPI_SCLK_SPEED_DIV16						3
#define SPI_SCLK_SPEED_DIV32						4
#define SPI_SCLK_SPEED_DIV64						5
#define SPI_SCLK_SPEED_DIV128						6
#define SPI_SCLK_SPEED_DIV256						7

#define SPI_DFF_8BITS		0
#define SPI_DFF_16BITS	1

#define SPI_CPOL_HIGH 	1
#define SPI_CPOL_LOW		0

#define SPI_CPHA_HIGH 	1
#define SPI_CPHA_LOW		0

#define SPI_SSM_EN			1
#define SPI_SSM_DIS			0

#define SPI_TXE_FLAG ( 1<< SPI_SR_TXE)
#define SPI_RXNE_FLAG ( 1 << SPI_SR_RXNE)
#define SPI_BUSY_FLAG ( 1 << SPI_SR_BSY)

#define SPI_READY				0
#define SPI_BUSY_IN_RX	1
#define SPI_BUSY_IN_TX	2

#define SPI_EVENT_TX_CMPLT 	1
#define SPI_EVENT_RX_CMPLT	2
#define SPI_EVENT_OVR_ERR		3
#define SPI_EVENT_CRC_ERR		4

void SPI_PeriClockControl(SPI_RegDef_t *pSPIx, uint8_t EnOrDis);

void SPI_Init(SPI_Handle_t *pSPIHandle);
void SPI_DeInit(SPI_RegDef_t *pSPIx);

void SPI_SendData(SPI_RegDef_t *pSPIx, uint8_t *pTxBuffer, uint32_t length);
void SPI_ReceiveData(SPI_RegDef_t *pSPIx, uint8_t *pRxBuffer, uint32_t length);

void SPI_PeripheralControl(SPI_RegDef_t *pSPIx, uint8_t EnOrDis);
void SPI_SSIConfig(SPI_RegDef_t *pSPIx, uint8_t EnOrDis);
void SPI_SSOEConfig(SPI_RegDef_t *pSPIx, uint8_t EnOrDis);
uint8_t SPI_GetFlagStatus(SPI_RegDef_t *pSPIx, uint32_t FlagName);

uint8_t SPI_SendDataIT(SPI_Handle_t *pSPIHandle, uint8_t *pTxBuffer, uint32_t length);
uint8_t SPI_ReceiveDataIT(SPI_Handle_t *pSPIHandle, uint8_t *pRxBuffer, uint32_t length);

void SPI_IRQInterruptConfig(uint8_t IRQNumber, uint8_t EnOrDis);
void SPI_IRQPriorityConfig(uint8_t IRQNumber, uint32_t IRQPriority);
void SPI_IRQHandling(SPI_Handle_t *pHandle);

void SPI_ClearOVRFlag(SPI_RegDef_t *pSPIx);
void SPI_CloseReception(SPI_Handle_t *pSPIHandle);
void SPI_CloseTransmission(SPI_Handle_t *pSPIHandle);

void SPI_ApplicationEventCallBack(SPI_Handle_t *pSPIHandle, uint8_t AppEv);
	
#endif